import React from "react";
import '../css/info.css';

export default function InfoArabic(props) {
    return (
        <div className={"info"} scroll-marker="1" style={{
            transform: `translateY(${props.scroll?.y || 0}px)`,
            transitionDuration: '0s',
        }}>
            <div className="infoTitle">
                <div style={{ color: '#fbaa19' }}>Issie</div>
                <div style={{ color: '#18b9ed' }}>Sign - Arabic</div>
            </div>
            <div className="heb"  >
                <bold>IssieSign</bold> هو تطبيق لتعليم الإشارات الأساسية والانكشاف على لغة الإشارة، بناءً على لغة الإشارة الإسرائيلية (ISL) ، وذلك من اجل للتعبير عن الاحتياجات الأساسية، المشاعر والأفكار. تم تطوير التطبيق بشكل خاص للأشخاص ذوي احتياجات التواصل المركبة (CCN) والذين يجدون صعوبة في التعبير عن أنفسهم كلاميا ويستندون على استخدام التواصل الداعم والبديل بما في ذلك الايماءات والاشارات للتعبير عن أنفسهم. هذا التطبيق هو من انتاج المركز التكنولوجي في ايزي شابيرا بالتعاون مع SAP Labs Israel .
                <br />
                <br />
            </div>
            <div className="heb" >
                <br />
                <bold>محتوى  التطبيق:</bold>
                <br />
                <br />
                <ul>
                    <li>ما يقارب 800 فيديو قصير تهدف لتعليم لغة الإشارة المتداولة في بلادنا.</li>
                    <li>مع كل واحده من لغة الإشارة التي تظهر في الفيديو تظهر هناك أيضا الكلمة المنطوقة كلاما والكلمة المكتوبة ورمز مألوف من مكتبة الرموز العالمية   SymbolStix* ،  تُستخدم  هذه الرموز في العديد  من المؤسسات ومن قبل طلاب  التربية الخاصة كوسيلة للتواصل الداعم والبديل AAC.</li>
                    <li>تم تصنيف الرموز حسب مجموعات لغوية مع تخصيص لون معين لكل واحده من هذه المجموعات لسهولة التعرف عليها ونجاعة الاستخدام حيث يمكن للمستخدم ان يعاود الرجوع للمجموعة حسب اللون مرة أخرى.</li>
                    <li>تم تنظيم كل فيديو وفقًا للمراحل الأولى من تطور اللغة - يحتوي كل فيديو على تعبير كلامي مكون من كلمة واحدة، وتعبير يتبعه يتكون من كلمتين. على سبيل المثال، كلمه "كلب" متبوعة بالمقطع "كلب كبير".</li>
                </ul>
                <br />
            </div>
            <div className="heb">
                <br />
                تم تصميم IssieSign  والعديد من التطبيقات الأخرى بمبادرة المركز التكنولوجي في بيت ايزي شبيرا ، المتخصص في تذويت استخدام التكنولوجيا المساندة (AT)  ويعتبر رائدا لتعزيز الابتكار والتطوير في المجال، مما يوفر حلولًا متاحة وبأسعار معقولة بهدف تحسين المشاركة ونوعية الحياة للأشخاص من ذوي الإعاقة. نحن نقدم خدمات الاستشارة والتدريب للطواقم المهنية وللعائلات والاستشارات والدعم للمطورين ورجال الأعمال لمساعدتهم على إنشاء تطبيقات ومنتجات يمكن الوصول إليها من قبل جمهور أوسع بما في ذلك الأشخاص ذوي الإعاقة.
                <br />
            </div>
            <div className="heb">

                شكر خاص للطاقم المهني والمتفاني في SAP Labs ، إسرائيل ، فكل الفضل لهم في اخراج التطبيق للضوء ونقله من الفكرة إلى المنتج. شكرًا لآن جونسون- اوليس ، من شركة n2y ، على المتابعه والإرشاد في كل ما يخص  رموز Symbolstix ، وشكر كبير لملاك منصورو للي دان على الترجمة إلى لغة الإشارة ولستوديو بيان على التصوير والمونتاج.            </div>
            <br />
            <div className="en">
                <br />
                Copyright SymbolStix, LLC. 2018. All rights reserved. Used with permission
            </div>

            <div className="heb" >
                <br />
                <bold>
                    جميع الحقوق محفوظة.
                </bold>
            </div>
        </div>
            )

}
